<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest FileMaker Pro updater disk image and extracts the package from within.</string>
	<key>Identifier</key>
	<string>com.github.nzmacgeek.download.filemakerupdater</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileMaker Pro</string>
		<key>major_version</key>
		<string>16</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>major_version</key>
				<string>%major_version%</string>
			</dict>
			<key>Processor</key>
			<string>FilemakerUpdateURLProcessor</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>downloaded_file</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FilemakerUpdateExtractor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/FileMakerProUpdater_%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
